cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
brew 'mas'

brew 'bash-completion'
brew 'gnutls'

brew 'git'
brew 'gh'

brew 'bat'
brew 'fd'
brew 'fzy'
brew 'graphviz'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'jsonpp'
brew 'rename'
brew 'rg'
brew 'rlwrap'
brew 'shellcheck'
brew 'tree'
brew 'wget'

cask '1password'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'obsidian'
cask 'raycast'
cask 'visual-studio-code'

cask 'font-ia-writer-duospace'
cask 'font-inter'
